In [1]:
'''
Write a solution to report the first name, last name, city, and state 
of each person in the Person table. 
If the address of a personId is not present in the Address table, report null instead.
'''

'\nWrite a solution to report the first name, last name, city, and state \nof each person in the Person table. \nIf the address of a personId is not present in the Address table, report null instead.\n'

In [2]:
import pandas as pd 
from pandasql import sqldf

In [3]:

person = {
    "personId": [1, 2],
    "lastName": ['Wang', 'Alice'],
    "firstName": ['Allen', 'Bob']
}

address = {
    "addressId": [1,2],
    "personId": [2,3],
    "city":['New York City', 'Leetcode'],
    "state": ['New York', 'California']
}

Persons = pd.DataFrame(person)
Address = pd.DataFrame(address)

In [4]:
Persons

   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

In [5]:
Address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [6]:
def combine_two_tables(df1, df2):
    query = sqldf(
        """
        SELECT 
            df1.firstname,
            df1.lastName,
            df2.city,
            df2.state
        FROM df1 
            LEFT JOIN df2
            ON df1.personId = df2.personId
        """
    )
    return query

In [9]:
def combine_two_tables(df1, df2):
    query = df1.merge(df2, on="personId", how = "left")
    return query[['firstName', 'lastName', 'city', 'state']]

In [10]:
combine_two_tables(df1=Persons, df2=Address)

  firstName lastName           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York